<?php

echo('Задание 1. Дан массив [[399, 9160, 144, 3230, 407, 8875, 1597, 9835], [2093, 3279, 21, 9038, 918, 9238, 2592, 7467], [3531, 1597, 3225, 153, 9970, 2937, 8, 807], [7010, 662, 6005, 4181, 3, 4606, 5, 3980], [6367, 2098, 89, 13, 337, 9196, 9950, 5424], [7204, 9393, 7149, 8, 89, 6765, 8579, 55], [1597, 4360, 8625, 34, 4409, 8034, 2584, 2], [920, 3172, 2400, 2326, 3413, 4756, 6453, 8], [4914, 21, 4923, 4012, 7960, 2254, 4448, 1]]. Среди его ячеек некоторые числа являются числами Фибоначчи (числами, участвующими в последовательности Фибоначчи: 1, 1, 2, 3, 5, 8, 13, 21). Найдите сумму чисел Фибоначчи в этом массиве.'.PHP_EOL);

// Ищем макс значение в заданном массиве
// Создаем список чисел Фибоначчи до макс числа
// Находим вхождения в заданный массив
// Находим сумму вхождений


$numbers_array = [[399, 9160, 144, 3230, 407, 8875, 1597, 9835], [2093, 3279, 21, 9038, 918, 9238, 2592, 7467], [3531, 1597, 3225, 153, 9970, 2937, 8, 807], [7010, 662, 6005, 4181, 3, 4606, 5, 3980], [6367, 2098, 89, 13, 337, 9196, 9950, 5424], [7204, 9393, 7149, 8, 89, 6765, 8579, 55], [1597, 4360, 8625, 34, 4409, 8034, 2584, 2], [920, 3172, 2400, 2326, 3413, 4756, 6453, 8], [4914, 21, 4923, 4012, 7960, 2254, 4448, 1]];

// Ищем макс значение в заданном массиве
$array_max_value = 0;

foreach ($numbers_array as $inside_array) {
    foreach ($inside_array as $value) {
        if ($value > $array_max_value) {
            $array_max_value = $value;
        }
    }
}

// Создаем список чисел Фибоначчи до макс числа
$fibo_array = [0, 1];
while ($fibo_array[array_key_last($fibo_array)] <= $array_max_value) {    
    $next_fibo_number = $fibo_array[array_key_last($fibo_array)] + $fibo_array[array_key_last($fibo_array) - 1];
    if ($next_fibo_number <= $array_max_value) {
        $fibo_array[] = $next_fibo_number;
    }else {
        break;
    }
}


// Находим вхождения в заданный массив
foreach ($numbers_array as $inside_array) {
    $result[] = array_intersect($inside_array, $fibo_array);
}

// Находим сумму вхождений
$sum = 0;
foreach ($result as $inside_array) {
    $sum += array_sum($inside_array);
}

echo("Сумма: ".$sum.PHP_EOL);

?>